import React from 'react';
import styles from '../components/style.module.css'; 
const ShoppingCart = () => {
  return (
    <div>
      <div id="container">
        <a>Tài khoản</a>
        <a>Đăng xuất</a>
        <a>Liên hệ</a>
      </div>
      <div id="banner">
      <img src="../public/images/Rectangle_2c.png" alt="Banner" />
      </div>
      <div id="mene" className={styles.menu}>
        <table>         
            <th>HOME</th>
            <th>CLOTHING</th>
            <th>CONTACT</th>
            <th><span className="red-bg">CLEARANCE SALE</span></th>
            <th style={{ paddingLeft: '577px' }}>
              <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 67 69" fill="none">
                {<path d="M29.3125 47.4375C31.5121 47.4375 33.6902 46.9913 35.7225 46.1244C37.7547 45.2575 39.6012 43.9869 41.1565 42.3851C42.7119 40.7833 43.9457 38.8816 44.7875 36.7888C45.6293 34.6959 46.0625 32.4528 46.0625 30.1875C46.0625 27.9222 45.6293 25.6791 44.7875 23.5862C43.9457 21.4933 42.7119 19.5917 41.1565 17.9899C39.6012 16.3881 37.7547 15.1175 35.7225 14.2506C33.6902 13.3837 31.5121 12.9375 29.3125 12.9375C24.8701 12.9375 20.6097 14.7549 17.4685 17.9899C14.3272 21.2249 12.5625 25.6125 12.5625 30.1875C12.5625 34.7625 14.3272 39.1501 17.4685 42.3851C20.6097 45.6201 24.8701 47.4375 29.3125 47.4375ZM46.9558 44.2922L56.95 54.5847C57.2164 54.8501 57.4289 55.1675 57.575 55.5184C57.721 55.8693 57.7978 56.2466 57.8007 56.6283C57.8037 57.0101 57.7328 57.3886 57.5922 57.7418C57.4516 58.095 57.2441 58.4159 56.9818 58.6856C56.7195 58.9554 56.4076 59.1686 56.0644 59.3129C55.7213 59.4572 55.3536 59.5297 54.9829 59.5261C54.6123 59.5225 54.246 59.443 53.9055 59.292C53.565 59.1411 53.2571 58.9219 52.9998 58.6471L43.0056 48.3546C38.5179 51.9422 32.8713 53.6336 27.2153 53.0845C21.5592 52.5355 16.319 49.7873 12.5613 45.3993C8.80352 41.0113 6.81079 35.3135 6.98874 29.4656C7.16668 23.6178 9.50192 18.0596 13.5191 13.9226C17.5362 9.78553 22.9333 7.38059 28.6116 7.19733C34.2899 7.01408 39.8226 9.06628 44.0834 12.9362C48.3442 16.8061 51.0128 22.2028 51.5459 28.0276C52.079 33.8525 50.4366 39.6677 46.953 44.2894L46.9558 44.2922Z" fill="black"/>}
              </svg>
            </th>
            <th style={{ paddingLeft: '17px' }}>
              <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 67 69" fill="none">
                {<path d="M53.0417 20.125H44.6667V17.25C44.6667 14.2 43.4902 11.2749 41.396 9.11827C39.3019 6.9616 36.4616 5.75 33.5 5.75C30.5384 5.75 27.6981 6.9616 25.604 9.11827C23.5098 11.2749 22.3333 14.2 22.3333 17.25V20.125H13.9583C13.2179 20.125 12.5079 20.4279 11.9843 20.9671C11.4608 21.5062 11.1667 22.2375 11.1667 23V54.625C11.1667 56.9125 12.049 59.1063 13.6196 60.7238C15.1903 62.3413 17.3205 63.25 19.5417 63.25H47.4583C49.6795 63.25 51.8097 62.3413 53.3803 60.7238C54.951 59.1063 55.8333 56.9125 55.8333 54.625V23C55.8333 22.2375 55.5392 21.5062 55.0157 20.9671C54.4921 20.4279 53.7821 20.125 53.0417 20.125ZM27.9167 17.25C27.9167 15.725 28.5049 14.2625 29.552 13.1841C30.5991 12.1058 32.0192 11.5 33.5 11.5C34.9808 11.5 36.4009 12.1058 37.448 13.1841C38.4951 14.2625 39.0833 15.725 39.0833 17.25V20.125H27.9167V17.25ZM50.25 54.625C50.25 55.3875 49.9559 56.1188 49.4323 56.6579C48.9088 57.1971 48.1987 57.5 47.4583 57.5H19.5417C18.8013 57.5 18.0912 57.1971 17.5677 56.6579C17.0441 56.1188 16.75 55.3875 16.75 54.625V25.875H22.3333V28.75C22.3333 29.5125 22.6275 30.2438 23.151 30.7829C23.6745 31.3221 24.3846 31.625 25.125 31.625C25.8654 31.625 26.5755 31.3221 27.099 30.7829C27.6225 30.2438 27.9167 29.5125 27.9167 28.75V25.875H39.0833V28.75C39.0833 29.5125 39.3775 30.2438 39.901 30.7829C40.4245 31.3221 41.1346 31.625 41.875 31.625C42.6154 31.625 43.3255 31.3221 43.849 30.7829C44.3725 30.2438 44.6667 29.5125 44.6667 28.75V25.875H50.25V54.625Z" fill="black"/>}
              </svg>
            </th>          
        </table>
      </div>
      <br />
      <a1>Trang chủ / Giỏ hàng</a1>
      <div id="Content">
        <p style={{ paddingTop: '30px' }}>Giỏ hàng của bạn</p>
        <br></br>
        <table style={{ width: '100%' }}>
        <td>Ảnh sản phẩm</td>
            <td >Tên sản phẩm</td>
            <td>Size</td>
            <td>Đơn giá</td>
            <td>Số lượng</td>
            <td>Thành tiền</td>
            <td>Xóa</td>
                <td>
                   <img src="../public/images/aoden.jpg" alt="Product Image" style={{ width: '100px' }}/>
                </td>
                <td>DEVIL TEE - CREAM</td>
                <td>S</td>
                <td>395.000₫</td>
                <td>1</td>
                <td>395.000₫</td>
                <td><svg xmlns="http://www.w3.org/2000/svg" width="19" height="19" viewBox="0 0 36 37" fill="none">
                    <path d="M15.4286 0C12.6 0 10.2857 2.08125 10.2857 4.625H5.14286C2.31429 4.625 0 6.70625 0 9.25H36C36 6.70625 33.6857 4.625 30.8571 4.625H25.7143C25.7143 2.08125 23.4 0 20.5714 0H15.4286ZM5.14286 13.875V36.1213C5.14286 36.63 5.55429 37 6.12 37H29.9314C30.4971 37 30.9086 36.63 30.9086 36.1213V13.875H25.7657V30.0625C25.7657 31.3575 24.6343 32.375 23.1943 32.375C21.7543 32.375 20.6229 31.3575 20.6229 30.0625V13.875H15.48V30.0625C15.48 31.3575 14.3486 32.375 12.9086 32.375C11.4686 32.375 10.3371 31.3575 10.3371 30.0625V13.875H5.19429H5.14286Z" fill="black"/>
                  </svg></td>
            <td>
                   <img src="../public/images/aoden.jpg" alt="Product Image" style={{ width: '100px' }}/>
                </td>
                <td>ANGEL TEE - BLACK</td>
                <td>S</td>
                <td>395.000₫</td>
                <td>2</td>
                <td>395.000₫</td>
                <td><svg xmlns="http://www.w3.org/2000/svg" width="19" height="19" viewBox="0 0 36 37" fill="none">
                    <path d="M15.4286 0C12.6 0 10.2857 2.08125 10.2857 4.625H5.14286C2.31429 4.625 0 6.70625 0 9.25H36C36 6.70625 33.6857 4.625 30.8571 4.625H25.7143C25.7143 2.08125 23.4 0 20.5714 0H15.4286ZM5.14286 13.875V36.1213C5.14286 36.63 5.55429 37 6.12 37H29.9314C30.4971 37 30.9086 36.63 30.9086 36.1213V13.875H25.7657V30.0625C25.7657 31.3575 24.6343 32.375 23.1943 32.375C21.7543 32.375 20.6229 31.3575 20.6229 30.0625V13.875H15.48V30.0625C15.48 31.3575 14.3486 32.375 12.9086 32.375C11.4686 32.375 10.3371 31.3575 10.3371 30.0625V13.875H5.19429H5.14286Z" fill="black"/>
                  </svg></td>
            <td>
                   <img src="../public/images/aoden.jpg" alt="Product Image" style={{ width: '100px' }}/>
                </td>
                <td>ANGEL TEE - BLACK</td>
                <td>S</td>
                <td>395.000₫</td>
                <td>2</td>
                <td>395.000₫</td>
                <td><svg xmlns="http://www.w3.org/2000/svg" width="19" height="19" viewBox="0 0 36 37" fill="none">
                    <path d="M15.4286 0C12.6 0 10.2857 2.08125 10.2857 4.625H5.14286C2.31429 4.625 0 6.70625 0 9.25H36C36 6.70625 33.6857 4.625 30.8571 4.625H25.7143C25.7143 2.08125 23.4 0 20.5714 0H15.4286ZM5.14286 13.875V36.1213C5.14286 36.63 5.55429 37 6.12 37H29.9314C30.4971 37 30.9086 36.63 30.9086 36.1213V13.875H25.7657V30.0625C25.7657 31.3575 24.6343 32.375 23.1943 32.375C21.7543 32.375 20.6229 31.3575 20.6229 30.0625V13.875H15.48V30.0625C15.48 31.3575 14.3486 32.375 12.9086 32.375C11.4686 32.375 10.3371 31.3575 10.3371 30.0625V13.875H5.19429H5.14286Z" fill="black"/>
                  </svg></td>
        </table>
        <table style={{ marginTop: '20px', marginLeft: '823px', width: '400px', height: '77px' }}>
                <tr>
                    <td>Tạm tính</td>
                    <td>790.000₫</td>
                </tr>
                <tr>
                    <td>Tổng tiền thanh toán</td>
                    <td><strong>790.000₫</strong></td>          
                </tr>
        </table>
        <button style={{ marginLeft: '4%' }}><strong>Tiếp tục mua hàng</strong></button>
        <br />
        <button style={{ marginLeft: '823px', width: '400px', height: '50px', fontSize: '19px' }}><strong>Tiến hành thanh toán</strong></button>
      </div>
    <section className="footer">
        <div className="footer-row">
          <div className="footer-col">
            <h4>Info</h4>
            <ul className="links">
              <li><a href="#">About Us</a></li>
              <li><a href="#">Compressions</a></li>
              <li><a href="#">Customers</a></li>
              <li><a href="#">Service</a></li>
              <li><a href="#">Collection</a></li>
            </ul>
          </div>
  
          <div className="footer-col">
            <h4>Get Help</h4>
            <ul className="links">
              <li><a href="#">FAQ</a></li>
              <li><a href="#">Shipping</a></li>
              <li><a href="#">Returns</a></li>
              <li><a href="#">Order Status</a></li>
              <li><a href="#">Payment Options</a></li>
            </ul>
          </div>
  
          <div className="footer-col">
            <h4>Quick Links</h4>
            <ul className="links">
              <li><a href="#">Terms and Conditions</a></li>
              <li><a href="#">Privacy Policy</a></li>
              <li><a href="#">Disclaimer</a></li>
            </ul>
          </div>
  
          <div className="footer-col">
            <h4>Follow Us</h4>
            <p>
              
            </p>
            
            <div className="icons">
              <i className="fa-brands fa-facebook-f"></i>
              <i className="fa-brands fa-twitter"></i>
              <i className="fa-brands fa-instagram"></i>
              <i className="fa-brands fa-youtube"></i>
            </div>
          </div>
        </div>
      </section>
      </div>
  );
};

export default ShoppingCart;
